In [1]:
import numpy as np
import pandas as pd

counteries = ['USA','Nigeria','France','Ghana']
my_data = [100, 200, 300, 400]
pd.Series(my_data, counteries)

USA        100
Nigeria    200
France     300
Ghana      400
dtype: int64

In [3]:
np_arr = np.array(my_data)
pd.Series(np_arr)

0    100
1    200
2    300
3    400
dtype: int32

In [8]:

my_dict = {'a':50, 'b':60, 'c':70, 'd':80}
pd.Series(my_dict)

a    50
b    60
c    70
d    80
dtype: int64

In [20]:
series1 = pd.Series([1, 2, 3, 4],['London', 'HongKong', 'Lagos', 'Humbai'])
print('----series1----\n',series1)
series2 = pd.Series([1, 3, 6, 4],['London', 'Accra', 'Lagos', 'Delhi'])
print('----series2----\n',series2)

print('*'*20)
print(series1 - series2)
print('*'*20)
print(series1+series2)
print('*'*20)
print(series1*series2)

----series1----
 London      1
HongKong    2
Lagos       3
Humbai      4
dtype: int64
----series2----
 London    1
Accra     3
Lagos     6
Delhi     4
dtype: int64
********************
Accra       NaN
Delhi       NaN
HongKong    NaN
Humbai      NaN
Lagos      -3.0
London      0.0
dtype: float64
********************
Accra       NaN
Delhi       NaN
HongKong    NaN
Humbai      NaN
Lagos       9.0
London      2.0
dtype: float64
********************
Accra        NaN
Delhi        NaN
HongKong     NaN
Humbai       NaN
Lagos       18.0
London       1.0
dtype: float64

In [21]:
df = {'Name':pd.Series(['Jon','Aaron','Todd'],index=['a','b','c']),
'Age':pd.Series(['39','34','32','33'],index=['a','b','c','d']),
'Nationality':pd.Series(['US','China','US'],index=['a','b','c'])}
pd.DataFrame(df)

    Name Age Nationality
a    Jon  39          US
b  Aaron  34       China
c   Todd  32          US
d    NaN  33         NaN

In [26]:
data = {'name':['George','Ann','Tino','Charles','Phil'],
'age':[40, 24, 31, 21, 23],
'year':[2012, 2012, 2013, 2014, 2014]}
my_df = pd.DataFrame(data,index = ['Lagos', 'Dubai','Mumbai','Accra','Yuma'])
my_df

           name  age  year
Lagos    George   40  2012
Dubai       Ann   24  2012
Mumbai     Tino   31  2013
Accra   Charles   21  2014
Yuma       Phil   23  2014

In [31]:
my_df[['year','name']]

        year     name
Lagos   2012   George
Dubai   2012      Ann
Mumbai  2013     Tino
Accra   2014  Charles
Yuma    2014     Phil